zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_SIUL2.h
/*! @name GPDO194 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO194_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO194_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO194_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO194_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO194_PDO_n_SHIFT)) & SIUL2_GPDO194_PDO_n_MASK)
/*! @} */

/*! @name GPDO193 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO193_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO193_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO193_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO193_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO193_PDO_n_SHIFT)) & SIUL2_GPDO193_PDO_n_MASK)
/*! @} */

/*! @name GPDO192 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO192_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO192_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO192_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO192_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO192_PDO_n_SHIFT)) & SIUL2_GPDO192_PDO_n_MASK)
/*! @} */

/*! @name GPDO199 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO199_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO199_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO199_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO199_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO199_PDO_n_SHIFT)) & SIUL2_GPDO199_PDO_n_MASK)
/*! @} */

/*! @name GPDO198 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO198_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO198_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO198_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO198_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO198_PDO_n_SHIFT)) & SIUL2_GPDO198_PDO_n_MASK)
/*! @} */

/*! @name GPDO197 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO197_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO197_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO197_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO197_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO197_PDO_n_SHIFT)) & SIUL2_GPDO197_PDO_n_MASK)
/*! @} */

/*! @name GPDO196 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO196_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO196_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO196_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO196_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO196_PDO_n_SHIFT)) & SIUL2_GPDO196_PDO_n_MASK)
/*! @} */

/*! @name GPDO203 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO203_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO203_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO203_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO203_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO203_PDO_n_SHIFT)) & SIUL2_GPDO203_PDO_n_MASK)
/*! @} */

/*! @name GPDO202 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO202_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO202_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO202_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO202_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO202_PDO_n_SHIFT)) & SIUL2_GPDO202_PDO_n_MASK)
/*! @} */

/*! @name GPDO201 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO201_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO201_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO201_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO201_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO201_PDO_n_SHIFT)) & SIUL2_GPDO201_PDO_n_MASK)
/*! @} */

/*! @name GPDO200 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO200_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO200_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO200_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO200_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO200_PDO_n_SHIFT)) & SIUL2_GPDO200_PDO_n_MASK)
/*! @} */

/*! @name GPDO207 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO207_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO207_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO207_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO207_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO207_PDO_n_SHIFT)) & SIUL2_GPDO207_PDO_n_MASK)
/*! @} */

/*! @name GPDO206 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO206_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO206_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO206_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO206_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO206_PDO_n_SHIFT)) & SIUL2_GPDO206_PDO_n_MASK)
/*! @} */

/*! @name GPDO205 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO205_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO205_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO205_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO205_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO205_PDO_n_SHIFT)) & SIUL2_GPDO205_PDO_n_MASK)
/*! @} */

/*! @name GPDO204 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO204_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO204_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO204_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO204_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO204_PDO_n_SHIFT)) & SIUL2_GPDO204_PDO_n_MASK)
/*! @} */

/*! @name GPDO211 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO211_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO211_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO211_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO211_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO211_PDO_n_SHIFT)) & SIUL2_GPDO211_PDO_n_MASK)
/*! @} */

/*! @name GPDO210 - SIUL2 GPIO Pad Data Output Register */
/*! @{ */

#define SIUL2_GPDO210_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO210_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO210_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO210_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO210_PDO_n_SHIFT)) & SIUL2_GPDO210_PDO_n_MASK)
/*! @} */

