zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_SIUL2.h
/*! @name GPDI168 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI168_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI168_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI168_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI168_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI168_PDI_n_SHIFT)) & SIUL2_GPDI168_PDI_n_MASK)
/*! @} */

/*! @name GPDI175 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI175_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI175_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI175_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI175_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI175_PDI_n_SHIFT)) & SIUL2_GPDI175_PDI_n_MASK)
/*! @} */

/*! @name GPDI174 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI174_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI174_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI174_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI174_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI174_PDI_n_SHIFT)) & SIUL2_GPDI174_PDI_n_MASK)
/*! @} */

/*! @name GPDI173 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI173_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI173_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI173_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI173_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI173_PDI_n_SHIFT)) & SIUL2_GPDI173_PDI_n_MASK)
/*! @} */

/*! @name GPDI172 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI172_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI172_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI172_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI172_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI172_PDI_n_SHIFT)) & SIUL2_GPDI172_PDI_n_MASK)
/*! @} */

/*! @name GPDI179 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI179_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI179_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI179_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI179_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI179_PDI_n_SHIFT)) & SIUL2_GPDI179_PDI_n_MASK)
/*! @} */

/*! @name GPDI178 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI178_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI178_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI178_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI178_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI178_PDI_n_SHIFT)) & SIUL2_GPDI178_PDI_n_MASK)
/*! @} */

/*! @name GPDI177 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI177_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI177_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI177_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI177_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI177_PDI_n_SHIFT)) & SIUL2_GPDI177_PDI_n_MASK)
/*! @} */

/*! @name GPDI176 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI176_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI176_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI176_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI176_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI176_PDI_n_SHIFT)) & SIUL2_GPDI176_PDI_n_MASK)
/*! @} */

/*! @name GPDI183 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI183_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI183_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI183_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI183_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI183_PDI_n_SHIFT)) & SIUL2_GPDI183_PDI_n_MASK)
/*! @} */

/*! @name GPDI182 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI182_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI182_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI182_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI182_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI182_PDI_n_SHIFT)) & SIUL2_GPDI182_PDI_n_MASK)
/*! @} */

/*! @name GPDI181 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI181_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI181_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI181_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI181_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI181_PDI_n_SHIFT)) & SIUL2_GPDI181_PDI_n_MASK)
/*! @} */

/*! @name GPDI180 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI180_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI180_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI180_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI180_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI180_PDI_n_SHIFT)) & SIUL2_GPDI180_PDI_n_MASK)
/*! @} */

/*! @name GPDI187 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI187_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI187_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI187_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI187_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI187_PDI_n_SHIFT)) & SIUL2_GPDI187_PDI_n_MASK)
/*! @} */

/*! @name GPDI186 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI186_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI186_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI186_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI186_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI186_PDI_n_SHIFT)) & SIUL2_GPDI186_PDI_n_MASK)
/*! @} */

/*! @name GPDI185 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI185_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI185_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI185_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI185_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI185_PDI_n_SHIFT)) & SIUL2_GPDI185_PDI_n_MASK)
/*! @} */

/*! @name GPDI184 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

