zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_SIUL2.h
/*! @name PGPDO12 - SIUL2 Parallel GPIO Pad Data Out Register */
/*! @{ */

#define SIUL2_PGPDO12_PPDO0_MASK                 (0x1U)
#define SIUL2_PGPDO12_PPDO0_SHIFT                (0U)
#define SIUL2_PGPDO12_PPDO0_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO0(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO0_SHIFT)) & SIUL2_PGPDO12_PPDO0_MASK)

#define SIUL2_PGPDO12_PPDO1_MASK                 (0x2U)
#define SIUL2_PGPDO12_PPDO1_SHIFT                (1U)
#define SIUL2_PGPDO12_PPDO1_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO1(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO1_SHIFT)) & SIUL2_PGPDO12_PPDO1_MASK)

#define SIUL2_PGPDO12_PPDO2_MASK                 (0x4U)
#define SIUL2_PGPDO12_PPDO2_SHIFT                (2U)
#define SIUL2_PGPDO12_PPDO2_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO2(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO2_SHIFT)) & SIUL2_PGPDO12_PPDO2_MASK)

#define SIUL2_PGPDO12_PPDO3_MASK                 (0x8U)
#define SIUL2_PGPDO12_PPDO3_SHIFT                (3U)
#define SIUL2_PGPDO12_PPDO3_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO3(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO3_SHIFT)) & SIUL2_PGPDO12_PPDO3_MASK)

#define SIUL2_PGPDO12_PPDO4_MASK                 (0x10U)
#define SIUL2_PGPDO12_PPDO4_SHIFT                (4U)
#define SIUL2_PGPDO12_PPDO4_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO4(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO4_SHIFT)) & SIUL2_PGPDO12_PPDO4_MASK)

#define SIUL2_PGPDO12_PPDO5_MASK                 (0x20U)
#define SIUL2_PGPDO12_PPDO5_SHIFT                (5U)
#define SIUL2_PGPDO12_PPDO5_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO5(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO5_SHIFT)) & SIUL2_PGPDO12_PPDO5_MASK)

#define SIUL2_PGPDO12_PPDO6_MASK                 (0x40U)
#define SIUL2_PGPDO12_PPDO6_SHIFT                (6U)
#define SIUL2_PGPDO12_PPDO6_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO6(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO6_SHIFT)) & SIUL2_PGPDO12_PPDO6_MASK)

#define SIUL2_PGPDO12_PPDO7_MASK                 (0x80U)
#define SIUL2_PGPDO12_PPDO7_SHIFT                (7U)
#define SIUL2_PGPDO12_PPDO7_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO7(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO7_SHIFT)) & SIUL2_PGPDO12_PPDO7_MASK)

#define SIUL2_PGPDO12_PPDO8_MASK                 (0x100U)
#define SIUL2_PGPDO12_PPDO8_SHIFT                (8U)
#define SIUL2_PGPDO12_PPDO8_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO8(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO8_SHIFT)) & SIUL2_PGPDO12_PPDO8_MASK)

#define SIUL2_PGPDO12_PPDO9_MASK                 (0x200U)
#define SIUL2_PGPDO12_PPDO9_SHIFT                (9U)
#define SIUL2_PGPDO12_PPDO9_WIDTH                (1U)
#define SIUL2_PGPDO12_PPDO9(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO9_SHIFT)) & SIUL2_PGPDO12_PPDO9_MASK)

#define SIUL2_PGPDO12_PPDO10_MASK                (0x400U)
#define SIUL2_PGPDO12_PPDO10_SHIFT               (10U)
#define SIUL2_PGPDO12_PPDO10_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO10(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO10_SHIFT)) & SIUL2_PGPDO12_PPDO10_MASK)

#define SIUL2_PGPDO12_PPDO11_MASK                (0x800U)
#define SIUL2_PGPDO12_PPDO11_SHIFT               (11U)
#define SIUL2_PGPDO12_PPDO11_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO11(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO11_SHIFT)) & SIUL2_PGPDO12_PPDO11_MASK)

#define SIUL2_PGPDO12_PPDO12_MASK                (0x1000U)
#define SIUL2_PGPDO12_PPDO12_SHIFT               (12U)
#define SIUL2_PGPDO12_PPDO12_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO12(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO12_SHIFT)) & SIUL2_PGPDO12_PPDO12_MASK)

#define SIUL2_PGPDO12_PPDO13_MASK                (0x2000U)
#define SIUL2_PGPDO12_PPDO13_SHIFT               (13U)
#define SIUL2_PGPDO12_PPDO13_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO13(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO13_SHIFT)) & SIUL2_PGPDO12_PPDO13_MASK)

#define SIUL2_PGPDO12_PPDO14_MASK                (0x4000U)
#define SIUL2_PGPDO12_PPDO14_SHIFT               (14U)
#define SIUL2_PGPDO12_PPDO14_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO14(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO14_SHIFT)) & SIUL2_PGPDO12_PPDO14_MASK)

#define SIUL2_PGPDO12_PPDO15_MASK                (0x8000U)
#define SIUL2_PGPDO12_PPDO15_SHIFT               (15U)
#define SIUL2_PGPDO12_PPDO15_WIDTH               (1U)
#define SIUL2_PGPDO12_PPDO15(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO12_PPDO15_SHIFT)) & SIUL2_PGPDO12_PPDO15_MASK)
/*! @} */

/*! @name PGPDI1 - SIUL2 Parallel GPIO Pad Data In Register */
/*! @{ */

#define SIUL2_PGPDI1_PPDI0_MASK                  (0x1U)
#define SIUL2_PGPDI1_PPDI0_SHIFT                 (0U)
#define SIUL2_PGPDI1_PPDI0_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI0(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI0_SHIFT)) & SIUL2_PGPDI1_PPDI0_MASK)

#define SIUL2_PGPDI1_PPDI1_MASK                  (0x2U)
#define SIUL2_PGPDI1_PPDI1_SHIFT                 (1U)
#define SIUL2_PGPDI1_PPDI1_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI1(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI1_SHIFT)) & SIUL2_PGPDI1_PPDI1_MASK)

#define SIUL2_PGPDI1_PPDI2_MASK                  (0x4U)
#define SIUL2_PGPDI1_PPDI2_SHIFT                 (2U)
#define SIUL2_PGPDI1_PPDI2_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI2(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI2_SHIFT)) & SIUL2_PGPDI1_PPDI2_MASK)

#define SIUL2_PGPDI1_PPDI3_MASK                  (0x8U)
#define SIUL2_PGPDI1_PPDI3_SHIFT                 (3U)
#define SIUL2_PGPDI1_PPDI3_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI3(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI3_SHIFT)) & SIUL2_PGPDI1_PPDI3_MASK)

#define SIUL2_PGPDI1_PPDI4_MASK                  (0x10U)
#define SIUL2_PGPDI1_PPDI4_SHIFT                 (4U)
#define SIUL2_PGPDI1_PPDI4_WIDTH                 (1U)
#define SIUL2_PGPDI1_PPDI4(x)                    (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI1_PPDI4_SHIFT)) & SIUL2_PGPDI1_PPDI4_MASK)

